In [4]:
import numpy as np
import pandas as pd

### 1. Create a DataFrame:
o Load the above dataset into a Pandas DataFram

In [3]:
sales = pd.DataFrame({'Order ID':[1001,1002,1003,1004,1005,1006,1007,1008],
                      'Customer':['Alice','Bot','Charlie','Alice','David','Charlie','Bob','Alice'],
                      'Product':['Laptop','Phone','Chair','Table','Laptop','Phone','Chair','Phone'],
                      'Category':['Electronics','Electronics','Electronics','Electronics','Electronics','Electronics','Electronics','Electronics'],
                      'Quantity':[2,1,4,1,1,2,2,1],
                      'Price':[800,500,100,250,800,500,100,500],
                      'Total Sales':[1600,500,400,250,800,1000,200,500]})
sales

   Order ID Customer Product     Category  Quantity  Price  Total Sales
0      1001    Alice  Laptop  Electronics         2    800         1600
1      1002      Bot   Phone  Electronics         1    500          500
2      1003  Charlie   Chair  Electronics         4    100          400
3      1004    Alice   Table  Electronics         1    250          250
4      1005    David  Laptop  Electronics         1    800          800
5      1006  Charlie   Phone  Electronics         2    500         1000
6      1007      Bob   Chair  Electronics         2    100          200
7      1008    Alice   Phone  Electronics         1    500          500

### 2. Add a New Column:
o Add a column Discount that gives a 10% discount on total
sales.

In [7]:
sales['Discount']= sales['Total Sales']*0.10

In [8]:
sales

,Order ID,Customer,Product,Category,Quantity,Price,Total Sales,Discount
0,1001,Alice,Laptop,Electronics,2,800,1600,160.0
1,1002,Bot,Phone,Electronics,1,500,500,50.0
2,1003,Charlie,Chair,Electronics,4,100,400,40.0
3,1004,Alice,Table,Electronics,1,250,250,25.0
4,1005,David,Laptop,Electronics,1,800,800,80.0
5,1006,Charlie,Phone,Electronics,2,500,1000,100.0
6,1007,Bob,Chair,Electronics,2,100,200,20.0
7,1008,Alice,Phone,Electronics,1,500,500,50.0

### 2. Add a New Column:
o Add a column Discount that gives a 10% discount on total
sales.

In [19]:
new_row=pd.DataFrame([{'Order ID':1009, 
                       'Customer':'Eve',
                        'Product':'Tablet',
                        'Category':'Electronics',
                        'Quantity':1,
                        'Price':300,
                        'Total Sales':300}])

In [20]:
new_row['Discount']=new_row['Total Sales']* 0.10

In [48]:
sales=pd.concat([sales, new_row])

In [60]:
sales

,Order ID,Customer,Product,Category,Quantity,Price,Total Sales,Discount
0,1001,Alice,Laptop,Electronics,2,800,1600,160.0
1,1002,Bot,Phone,Electronics,1,500,500,50.0
2,1003,Charlie,Chair,Electronics,4,100,400,40.0
3,1004,Alice,Table,Electronics,1,250,250,25.0
4,1005,David,Laptop,Electronics,1,800,800,80.0
5,1006,Charlie,Phone,Electronics,2,500,1000,100.0
6,1007,Bob,Chair,Electronics,2,100,200,20.0
7,1008,Alice,Phone,Electronics,1,500,500,50.0
0,1009,Eve,Tablet,Electronics,1,300,300,30.0

In [61]:
sales.reset_index(inplace=True)

In [62]:
sales

,index,Order ID,Customer,Product,Category,Quantity,Price,Total Sales,Discount
0,0,1001,Alice,Laptop,Electronics,2,800,1600,160.0
1,1,1002,Bot,Phone,Electronics,1,500,500,50.0
2,2,1003,Charlie,Chair,Electronics,4,100,400,40.0
3,3,1004,Alice,Table,Electronics,1,250,250,25.0
4,4,1005,David,Laptop,Electronics,1,800,800,80.0
5,5,1006,Charlie,Phone,Electronics,2,500,1000,100.0
6,6,1007,Bob,Chair,Electronics,2,100,200,20.0
7,7,1008,Alice,Phone,Electronics,1,500,500,50.0
8,0,1009,Eve,Tablet,Electronics,1,300,300,30.0

In [63]:
sales.drop('index',axis=1, inplace=True)

In [64]:
sales

,Order ID,Customer,Product,Category,Quantity,Price,Total Sales,Discount
0,1001,Alice,Laptop,Electronics,2,800,1600,160.0
1,1002,Bot,Phone,Electronics,1,500,500,50.0
2,1003,Charlie,Chair,Electronics,4,100,400,40.0
3,1004,Alice,Table,Electronics,1,250,250,25.0
4,1005,David,Laptop,Electronics,1,800,800,80.0
5,1006,Charlie,Phone,Electronics,2,500,1000,100.0
6,1007,Bob,Chair,Electronics,2,100,200,20.0
7,1008,Alice,Phone,Electronics,1,500,500,50.0
8,1009,Eve,Tablet,Electronics,1,300,300,30.0

### 4. Filter Data:
o Retrieve only the sales records where the Category is
"Electronics".

In [65]:
electronic_sales=sales[sales['Category']=='Electronics']

In [66]:
electronic_sales

,Order ID,Customer,Product,Category,Quantity,Price,Total Sales,Discount
0,1001,Alice,Laptop,Electronics,2,800,1600,160.0
1,1002,Bot,Phone,Electronics,1,500,500,50.0
2,1003,Charlie,Chair,Electronics,4,100,400,40.0
3,1004,Alice,Table,Electronics,1,250,250,25.0
4,1005,David,Laptop,Electronics,1,800,800,80.0
5,1006,Charlie,Phone,Electronics,2,500,1000,100.0
6,1007,Bob,Chair,Electronics,2,100,200,20.0
7,1008,Alice,Phone,Electronics,1,500,500,50.0
8,1009,Eve,Tablet,Electronics,1,300,300,30.0

### 5. Selection:
o Select the Customer and Total Sales columns.

In [67]:
customer_sales=sales[['Customer', 'Total Sales']]

In [68]:
customer_sales

  Customer  Total Sales
0    Alice         1600
1      Bot          500
2  Charlie          400
3    Alice          250
4    David          800
5  Charlie         1000
6      Bob          200
7    Alice          500
8      Eve          300

### 6. Grouping:
o Group the data by Customer and calculate the total sales per
customer.

In [70]:
total_sales= sales.groupby('Customer')['Total Sales'].sum()

In [71]:
total_sales

Customer
Alice      2350
Bob         200
Bot         500
Charlie    1400
David       800
Eve         300
Name: Total Sales, dtype: int64

### 7. Sorting:
o Sort the DataFrame based on Total Sales in descending
order.

In [85]:
sales_sorted= sales.sort_values(by='Total Sales',ascending=False)

In [86]:
sales_sorted

,Order ID,Customer,Product,Category,Quantity,Price,Total Sales,Discount
0,1001,Alice,Laptop,Electronics,2,800,1600,160.0
5,1006,Charlie,Phone,Electronics,2,500,1000,100.0
4,1005,David,Laptop,Electronics,1,800,800,80.0
7,1008,Alice,Phone,Electronics,1,500,500,50.0
1,1002,Bot,Phone,Electronics,1,500,500,50.0
2,1003,Charlie,Chair,Electronics,4,100,400,40.0
8,1009,Eve,Tablet,Electronics,1,300,300,30.0
3,1004,Alice,Table,Electronics,1,250,250,25.0
6,1007,Bob,Chair,Electronics,2,100,200,20.0

### Apply Function:
o Apply a lambda function to create a new column Sales
Category, where values are labeled as "High" if Total Sales >
1000, otherwise "Low"

In [87]:
sales['Sales Category']= sales['Total Sales'].apply(lambda x:'High' if x>1000 else 'Low')

In [88]:
sales

,Order ID,Customer,Product,Category,Quantity,Price,Total Sales,Discount,Sales Category
0,1001,Alice,Laptop,Electronics,2,800,1600,160.0,High
1,1002,Bot,Phone,Electronics,1,500,500,50.0,Low
2,1003,Charlie,Chair,Electronics,4,100,400,40.0,Low
3,1004,Alice,Table,Electronics,1,250,250,25.0,Low
4,1005,David,Laptop,Electronics,1,800,800,80.0,Low
5,1006,Charlie,Phone,Electronics,2,500,1000,100.0,Low
6,1007,Bob,Chair,Electronics,2,100,200,20.0,Low
7,1008,Alice,Phone,Electronics,1,500,500,50.0,Low
8,1009,Eve,Tablet,Electronics,1,300,300,30.0,Low

### 9. Save DataFrame:
o Save the final DataFrame as a CSV file named sales_data.csv.

In [89]:
sales.to_csv('sales_data.csv', index=False)